codedFixedValue/baseSimple/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
   {
        type           codedFixedValue;

        value        uniform (0 0 0);

        //- This slip BC calculates the tangential component based on the BJS condition
        //  and enforces zeroGradient for the normal component.
        name    BeaversJosephSaffmanExplicit;   

        code
        #{
            scalar phiFac(0.02);
            const vectorField nHat(this->patch().nf());
            const vectorField pif(this->patchInternalField());  

            const vectorField slipVelocity
            (
                -phiFac*transform(I - sqr(nHat),this->snGrad())
            ); 


            operator==((pif&sqr(nHat)) + slipVelocity);
            
        #};

        codeInclude
        #{
           #include "fvCFD.H"
           #include "symmTransformField.H"

        #};

        codeOptions
        #{
           -I$(LIB_SRC)/finiteVolume/lnInclude \
           -I$(LIB_SRC)/meshTools/lnInclude
        #};
    }


    inlet
    {
        type            fixedProfile;//fixedValue;
        value           uniform (1 0 0);

        profile         polynomial
        (
            ((1.5 0 0)        (0 0 0))
            ((-1.5 0 0)    (2 0 0))
        );
        direction       (0 0 1);
        origin          0;
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);

    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
