codedFixedValue/baseSimple/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0;
        maxIter         5;
    }

    "U"
    {
        solver          GAMG;
        smoother        DILU;
        tolerance       1e-8;
        relTol          0;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "UFinal"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   on;
    nOuterCorrectors    100000;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    pRefCell            0;
    pRefValue           0;
    turbOnFinalIterOnly no;

    outerCorrectorResidualControl
    {
        "p|U"
        {
            tolerance 1e-06;
            relTol        0;
        }
    }

}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes;
    
    residualControl
    {
        p               1e-5;
        U               1e-5;
    }

}


relaxationFactors
{
    equations
    {
        U               0.9;
    }
}


// ************************************************************************* //
